# GetWallControlOffset

## Description
Returns the default wall control line offset value.

```pascal
FUNCTION GetWallControlOffset : REAL;
```

```python

def vs.GetWallControlOffset():
    return REAL
```

## Version
```diff
- GetWallControlOffset is obsolete as of VectorWorks12.5
```

Availability: from VectorWorks8.5
## Category
* Objects - Walls